AMR/0/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

/*upperWall
{
    type slip;
}

frontAndBack
{
    type slip;
}*/
wall1
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
wall2  
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
wall3  
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
wall4  
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
wall5  
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
  wall-part-volvo_test
    {
        type            omegaWallFunction;
        value           uniform 10;
    }

// ************************************************************************* //
